
## Plan Result (ptl-jenkins)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_key_vault.jenkinskv-prod[0]
  * random_password.jenkins-agent-password2
* Delete
  * azurerm_cosmosdb_sql_role_assignment.this
  * azurerm_key_vault_secret.db


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_sql_role_assignment.this will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.this is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      - account_name        = "sds-jenkins-pipeline-metrics" -> null
      - id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics/sqlRoleAssignments/7f30322b-c657-d539-9454-84ff9ee9e634" -> null
      - name                = "7f30322b-c657-d539-9454-84ff9ee9e634" -> null
      - principal_id        = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> null
      - resource_group_name = "sds-jenkins-ptl-rg" -> null
      - role_definition_id  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.DocumentDB/databaseAccounts/sds-jenkins-pipeline-metrics" -> null
    }

  # azurerm_key_vault.jenkinskv-prod[0] will be created
  + resource "azurerm_key_vault" "jenkinskv-prod" {
      + access_policy              = (known after apply)
      + enable_rbac_authorization  = true
      + id                         = (known after apply)
      + location                   = "uksouth"
      + name                       = "ptl"
      + resource_group_name        = "sds-jenkins-ptl-rg"
      + sku_name                   = "standard"
      + soft_delete_enabled        = (known after apply)
      + soft_delete_retention_days = 7
      + tags                       = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-jenkins-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id                  = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                  = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_secret.db will be destroyed
  # (because azurerm_key_vault_secret.db is not in configuration)
  - resource "azurerm_key_vault_secret" "db" {
      - content_type   = "" -> null
      - id             = "https://ptl.vault.azure.net/secrets/cosmosdb-token-key/e79178d692954ea28ab8efb62f24b764" -> null
      - key_vault_id   = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-jenkins-ptl-rg/providers/Microsoft.KeyVault/vaults/ptl" -> null
      - name           = "cosmosdb-token-key" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "e79178d692954ea28ab8efb62f24b764" -> null
      - versionless_id = "https://ptl.vault.azure.net/secrets/cosmosdb-token-key" -> null
    }

  # random_password.jenkins-agent-password2 will be created
  + resource "random_password" "jenkins-agent-password2" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":40,"Program":"tfcmt","SHA1":"","Target":"ptl-jenkins","Vars":{}} -->